FALLSHIFT  IF   E           K DISK    RENAME(ALLSHIFT:ALLSHIFTR)
     FSHIFTRATESIF   E             DISK     RENAME(SHIFTRATES:SHIFTRATER)
     FCONFIRMPA2CF   E             WORKSTN
     FPAYPR2    O    E             PRINTER OFLIND(*IN01)
     DHOURSOVER        S              3  0
     DMain             PR                  EXTPGM('PAYROLLPG3')
     DShiftType                      30
     DMain             PI
     DShiftType                      30

       /FREE
       READ ShiftRates;
       Write Title;
       Write ColHdg;
       READ ALLSHIFT;
       DOW NOT %EOF;
         EXSR PAYSR;
         IF *IN01;
           Write Title;
           Write ColHdg;
           *IN01 = *Off;

         ENDIF;
         Write EmpDetail;
         READ ALLSHIFT;
       ENDDO;
       TOTEMPPAY = TOTREGPAY + TOTOVTPAY;
       WRITE TOTALS;
       EXFMT RECORD1;
       *INLR = *ON;
       RETURN;

       BEGSR PAYSR;
            SELECT;
                 WHEN (WORKSHIFT = 'D') ;
                   HOURLYRATE = DAYRATE;
                 WHEN (WORKSHIFT = 'A');
                   HOURLYRATE = AFTNRATE;
                 WHEN (WORKSHIFT = 'N');
                   HOURLYRATE = NIGHTRATE;
            ENDSL;

       IF PAYGRADE = '1';
         EVAL(H) HOURLYRATE = (HOURLYRATE * 1.088);
       ENDIF;

       IF PAYGRADE = '2';
         EVAL(H) HOURLYRATE = (HOURLYRATE * 1.055);
       ENDIF;

       IF PAYGRADE = '3';
         EVAL(H) HOURLYRATE = (HOURLYRATE * (1 - 0.055));
       ENDIF;

       IF HRSWORKED > 40;
         HOURSOVER = HRSWORKED - 40;
         EVAL(H) OVERPAY = (HOURSOVER * 1.5) * HOURLYRATE;
         TOTOVTPAY = TOTOVTPAY + OVERPAY;
       ENDIF;

       IF HRSWORKED > 40;
          REGULARPAY = (HRSWORKED - HOURSOVER) * HOURLYRATE;
          TOTREGPAY = TOTREGPAY + REGULARPAY;
          TOTALPAY = TOTREGPAY + TOTOVTPAY;
       ENDIF;

       IF HRSWORKED <= 40;
          REGULARPAY = HRSWORKED * HOURLYRATE;
          TOTREGPAY = TOTREGPAY + REGULARPAY;
          TOTALPAY = TOTREGPAY + TOTOVTPAY;
          OVERPAY = 0;
       ENDIF;

       ENDSR;
